/* Unicorn Emulator Engine */
/* By Nguyen Anh Quynh & Dang Hoang Vu, 2015 */

/* Sample code to demonstrate how to emulate X86 code */

#include <capstone/platform.h>
#include <capstone/capstone.h>

#include <unicorn/unicorn.h>
// #include "unicorn_test.h"
#include <string.h>
#include <Windows.h>


// code to be emulated
#define X86_CODE32 "\x41\x4a\x66\x0f\xef\xc1" // INC ecx; DEC edx; PXOR xmm0, xmm1
#define X86_CODE32_JUMP "\xeb\x02\x90\x90\x90\x90\x90\x90" // jmp 4; nop; nop; nop; nop; nop; nop
// #define X86_CODE32_SELF "\xeb\x1c\x5a\x89\xd6\x8b\x02\x66\x3d\xca\x7d\x75\x06\x66\x05\x03\x03\x89\x02\xfe\xc2\x3d\x41\x41\x41\x41\x75\xe9\xff\xe6\xe8\xdf\xff\xff\xff\x31\xd2\x6a\x0b\x58\x99\x52\x68\x2f\x2f\x73\x68\x68\x2f\x62\x69\x6e\x89\xe3\x52\x53\x89\xe1\xca\x7d\x41\x41\x41\x41"
//#define X86_CODE32 "\x51\x51\x51\x51" // PUSH ecx;
#define X86_CODE32_LOOP "\x41\x4a\xeb\xfe" // INC ecx; DEC edx; JMP self-loop
#define X86_CODE32_MEM_WRITE "\x89\x0D\xAA\xAA\xAA\xAA\x41\x4a" // mov [0xaaaaaaaa], ecx; INC ecx; DEC edx
#define X86_CODE32_MEM_READ "\x8B\x0D\xAA\xAA\xAA\xAA\x41\x4a" // mov ecx,[0xaaaaaaaa]; INC ecx; DEC edx

#define X86_CODE32_JMP_INVALID "\xe9\xe9\xee\xee\xee\x41\x4a" //  JMP outside; INC ecx; DEC edx
#define X86_CODE32_INOUT "\x41\xE4\x3F\x4a\xE6\x46\x43" // INC ecx; IN AL, 0x3f; DEC edx; OUT 0x46, AL; INC ebx
#define X86_CODE32_INC "\x40"   // INC eax


    if (err) {
        printf("Failed on uc_open() with error returned: %u\n", err);
        return;
    }

    // map 8KB memory for this emulation
    uc_mem_map(uc, 0, 8 * 1024, UC_PROT_ALL);

    // write machine code to be emulated to memory
    if (uc_mem_write(uc, 0, X86_CODE16, sizeof(X86_CODE16) - 1)) {
        printf("Failed to write emulation code to memory, quit!\n");
        return;
    }

    // initialize machine registers
    uc_reg_write(uc, UC_X86_REG_EAX, &eax);
    uc_reg_write(uc, UC_X86_REG_EBX, &ebx);
    uc_reg_write(uc, UC_X86_REG_ESI, &esi);

    // emulate machine code in infinite time (last param = 0), or when
    // finishing all the code.
    err = uc_emu_start(uc, 0, sizeof(X86_CODE16) - 1, 0, 0);
    if (err) {
        printf("Failed on uc_emu_start() with error returned %u: %s\n",
                err, uc_strerror(err));
    }

    // now print out some registers
    printf(">>> Emulation done. Below is the CPU context\n");

    // read from memory
    if (!uc_mem_read(uc, 11, &tmp, 1))
        printf(">>> Read 1 bytes from [0x%x] = 0x%x\n", 11, tmp);
    else
        printf(">>> Failed to read 1 bytes from [0x%x]\n", 11);

    uc_close(uc);
}

#if 0
int main(int argc, char** argv, char** envp)
{




	if (argc == 2) {
		if (!strcmp(argv[1], "-16")) {
			test_x86_16();
		}
		else if (!strcmp(argv[1], "-32")) {
			test_i386();
			test_i386_map_ptr();
			test_i386_inout();
			test_i386_context_save();
			test_i386_jump();
			test_i386_loop();
			test_i386_invalid_mem_read();
			test_i386_invalid_mem_write();
			test_i386_jump_invalid();
			//test_i386_invalid_c6c7();
		}
		else if (!strcmp(argv[1], "-64")) {
			test_x86_64();
			test_x86_64_syscall();
		}
		else if (!strcmp(argv[1], "-h")) {
			printf("Syntax: %s <-16|-32|-64>\n", argv[0]);
		}
	}
	else {
		test_x86_16();
		test_i386();
		test_i386_map_ptr();
		test_i386_inout();
		test_i386_context_save();
		test_i386_jump();
		test_i386_loop();
		test_i386_invalid_mem_read();
		test_i386_invalid_mem_write();
		test_i386_jump_invalid();
		//test_i386_invalid_c6c7();
		test_x86_64();
		test_x86_64_syscall();

	}

	return 0;
}
#endif



//0193DE53     8B00                 MOV EAX, DWORD PTR DS : [EAX]
//0193DE55     05 00100000          ADD EAX, 1000
//0193DE5A     0305 FFFFFFFF        ADD EAX, DWORD PTR DS : [FFFFFFFF]

#define TEST_HOOK_CODE "\x8B\x00\x05\x00\x10\x00\x00\xE8\x01\x01\x02\x02\x03\x05\xFF\xFF\xFF\xFF"
#define TEST_HOOK_CODE_SIZE     sizeof(TEST_HOOK_CODE)
#define REG						uint32_t
#define NAKED					__declspec(naked)
#define address_t               uint32_t
#define GetJumpOffset(src, dest, cmdsize)   ((src)-(dest)-(cmdsize))
static csh handle;
static uint8_t* g_hook_code[1024];
static uint8_t* g_hook_code_size = 1024;
#define HOOKINFO_ID					10
//hook code...
//PUSH ID
//JUMP HANDLE STUB

//handle stub...
//PUSH ID
//JUMP 

#pragma pack(push)
#pragma pack(1)
//0073DE53 > $ E9 18B2D100    JMP sample_a.01459070
//0073DE58     68 AAAAAAAA    PUSH AAAAAAAA
typedef struct {
    uint8_t cmd;    //0xE9
    address_t offset;
    //uint8_t cmd;    //0x68
    //address_t id;
} FixContent;
#pragma pack(pop)

#define MIN_HOOK_FIX_SIZE               5
#define STUB_SIZE                       0x20
#define SPRING_BOARD_SIZE               0x20

typedef struct {
    REG eax;
    REG ebx;
    REG ecx;
    REG edx;
    REG esi;
    REG edi;
    REG esp;
    REG ebp;
    REG efl;
}X86RegInfo;

void agent(void* fn, X86RegInfo* before, X86RegInfo* after) {
    //该函数不能有参数，必须从内存中把参数些为立即数
    __asm {
        pushad
        mov eax, before.efl

        mov eax, before.eax
        mov ebx, before.ebx
        mov ecx, before.ecx
        mov edx, before.edx
        mov esi, before.esi
        mov edi, before.edi
        mov esp, before.esp
        mov ebp, before.ebp
        call fn
        mov after.eax, eax
        mov after.ebx, ebx
        mov after.ecx, ecx
        mov after.edx, edx
        mov after.esi, esi
        mov after.edi, edi
        mov after.esp, esp
        mov after.ebp, ebp
        popad
    }
}

//019EDE53     A1 78563412    MOV EAX, DWORD PTR DS : [12345678]
//019EDE58     8B1D 78563412  MOV EBX, DWORD PTR DS : [12345678]
//019EDE5E     8B0D 78563412  MOV ECX, DWORD PTR DS : [12345678]
//019EDE64     8B15 78563412  MOV EDX, DWORD PTR DS : [12345678]
//019EDE6A     8B35 78563412  MOV ESI, DWORD PTR DS : [12345678]
//019EDE70     8B3D 78563412  MOV EDI, DWORD PTR DS : [12345678]
//019EDE76     8B25 78563412  MOV ESP, DWORD PTR DS : [12345678]
//019EDE7C     8B2D 78563412  MOV EBP, DWORD PTR DS : [12345678]
//019EDE82     E8 F1779510    CALL 12345678
//019EDE87     A3 78563412    MOV DWORD PTR DS : [12345678] , EAX
//019EDE8C     891D 78563412  MOV DWORD PTR DS : [12345678] , EBX
//019EDE92     890D 78563412  MOV DWORD PTR DS : [12345678] , ECX
//019EDE98     8915 78563412  MOV DWORD PTR DS : [12345678] , EDX
//019EDE9E     8935 78563412  MOV DWORD PTR DS : [12345678] , ESI
//019EDEA4     893D 78563412  MOV DWORD PTR DS : [12345678] , EDI
//019EDEAA     8925 78563412  MOV DWORD PTR DS : [12345678] , ESP
//019EDEB0     892D 78563412  MOV DWORD PTR DS : [12345678] , EBP

#pragma pack(push)
#pragma pack(1)
typedef struct {
    uint8_t cmd;
    uint8_t *address;
}MovContentAndEax;
typedef struct {
    uint8_t cmd[2];
    uint8_t *address;
}MovContentAndOtherReg;
//019EDEB7     50             PUSH EAX
//019EDEB8     9C             PUSHFD
//019EDEB9     58             POP EAX
//019EDEBA     A3 78563412    MOV DWORD PTR DS : [12345678] , EAX
//019EDEBF     58             POP EAX
typedef struct {
    uint8_t cmd1[4];
    uint8_t* address;
    uint8_t cmd2;
}MovEFlagsToContent;
//019EDEC1     50             PUSH EAX
//019EDEC2     A1 78563412    MOV EAX, DWORD PTR DS : [12345678]
//019EDEC7     50             PUSH EAX
//019EDEC8     9D             POPFD
//019EDEC9     58             POP EAX
typedef struct {
    uint8_t cmd1[2];
    uint8_t* address;
    uint8_t cmd2[3];
}MovContentToEFlags;
typedef struct {                 //mov reg, [addr]  //mov [addr], reg
    MovContentAndEax eax;        //0xA1             //0xA3
    MovContentAndOtherReg ebx;   //0x8B1D           //0x891D
    MovContentAndOtherReg ecx;   //0x8B0D           //0x890D
    MovContentAndOtherReg edx;   //0x8B15           //0x8915
    MovContentAndOtherReg esi;   //0x8B35           //0x8935
    MovContentAndOtherReg edi;   //0x8B3D           //0x893D
    MovContentAndOtherReg esp;   //0x8B25           //0x8925
    MovContentAndOtherReg ebp;   //0x8B2D           //0x892D
} MovContentAndRegs;
typedef struct {
    uint8_t cmd;
    uint8_t* address;
}CallAddress;
//019EDED0     83C4 04        ADD ESP,4
//019EDED3     FF6424 FC      JMP DWORD PTR SS : [ESP - 4]
typedef struct {
    uint8_t cmd[7];
}RetAddress;
typedef struct {
    MovEFlagsToContent bakupCurrentEFlags;
    MovContentAndRegs bakupCurrentContext;
    MovContentToEFlags setupVMEFlags;
    MovContentAndRegs setupVMContext;
    CallAddress call;
    MovEFlagsToContent bakupVMEFlags;
    MovContentAndRegs bakupVMContext;
    MovContentAndRegs setupCurrentContext;
    MovContentToEFlags setupCurrentEFlags;
    uint8_t retcmd;
}InvokeAgent;
typedef struct {
    MovContentToEFlags setupVMEFlags;
    MovContentAndRegs setupVMContext;
    uint8_t lastcmd[0x20];
    RetAddress ret;
}RetAgent;
#pragma pack(pop)

void initBackupEFlags(MovEFlagsToContent *cmdBuffer) {
    //019EDEB7     50             PUSH EAX
